HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY0_WRDS_1S61.
* To use register names with standard convension, please use ERAY0_WRDS_1S61.
*/
#define	ERAY_WRDS62	(ERAY0_WRDS_1S61)

/** \\brief  4F8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY0_WRDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4F8u)

/** Alias (User Manual Name) for ERAY0_WRDS_1S62.
* To use register names with standard convension, please use ERAY0_WRDS_1S62.
*/
#define	ERAY_WRDS63	(ERAY0_WRDS_1S62)

/** \\brief  4FC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY0_WRDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4FCu)

/** Alias (User Manual Name) for ERAY0_WRDS_1S63.
* To use register names with standard convension, please use ERAY0_WRDS_1S63.
*/
#define	ERAY_WRDS64	(ERAY0_WRDS_1S63)

/** \\brief  41C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY0_WRDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C41Cu)

/** Alias (User Manual Name) for ERAY0_WRDS_1S7.
* To use register names with standard convension, please use ERAY0_WRDS_1S7.
*/
#define	ERAY_WRDS08	(ERAY0_WRDS_1S7)

/** \\brief  420, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY0_WRDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C420u)

/** Alias (User Manual Name) for ERAY0_WRDS_1S8.
* To use register names with standard convension, please use ERAY0_WRDS_1S8.
*/
#define	ERAY_WRDS09	(ERAY0_WRDS_1S8)

/** \\brief  424, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY0_WRDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C424u)

/** Alias (User Manual Name) for ERAY0_WRDS_1S9.
* To use register names with standard convension, please use ERAY0_WRDS_1S9.
*/
#define	ERAY_WRDS10	(ERAY0_WRDS_1S9)

/** \\brief  500, Write Header Section 1 */
#define ERAY0_WRHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS1*)0xF001C500u)

/** Alias (User Manual Name) for ERAY0_WRHS1.
* To use register names with standard convension, please use ERAY0_WRHS1.
*/
#define	ERAY_WRHS1	(ERAY0_WRHS1)

/** \\brief  504, Write Header Section 2 */
#define ERAY0_WRHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS2*)0xF001C504u)

/** Alias (User Manual Name) for ERAY0_WRHS2.
* To use register names with standard convension, please use ERAY0_WRHS2.
*/
#define	ERAY_WRHS2	(ERAY0_WRHS2)

/** \\brief  508, Write Header Section 3 */
#define ERAY0_WRHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS3*)0xF001C508u)

/** Alias (User Manual Name) for ERAY0_WRHS3.
* To use register names with standard convension, please use ERAY0_WRHS3.
*/
#define	ERAY_WRHS3	(ERAY0_WRHS3)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_Cfg_Eray1
 * \{  */

/** \\brief  8FC, Access Enable Register 0 */
#define ERAY1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN0*)0xF00178FCu)

/** \\brief  8F8, Access Enable Register 1 */
#define ERAY1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN1*)0xF00178F8u)

/** \\brief  128, Aggregated Channel Status */
#define ERAY1_ACS /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACS*)0xF0017128u)

/** \\brief  104, Communication Controller Error Vector */
#define ERAY1_CCEV /*lint --e(923)*/ (*(volatile Ifx_ERAY_CCEV*)0xF0017104u)

/** \\brief  100, Communication Controller Status Vector */
#define ERAY1_CCSV /*lint --e(923)*/ (*(volatile Ifx_ERAY_CCSV*)0xF0017100u)

/** \\brief  0, Clock Control Register */
#define ERAY1_CLC /*lint --e(923)*/ (*(volatile Ifx_ERAY_CLC*)0xF0017000u)

/** \\brief  3F0, Core Release Register */
#define ERAY1_CREL /*lint --e(923)*/ (*(volatile Ifx_ERAY_CREL*)0xF00173F0u)

/** \\brief  4, Busy and Input Buffer Control Register */
#define ERAY1_CUST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST1*)0xF0017004u)

/** \\brief  C, Customer Interface Timeout Counter */
#define ERAY1_CUST3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST3*)0xF001700Cu)

/** \\brief  34, Error Service Request Enable Reset */
#define ERAY1_EIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIER*)0xF0017034u)

/** \\brief  30, Error Service Request Enable Set */
#define ERAY1_EIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIES*)0xF0017030u)

/** \\brief  28, Error Service Request Line Select */
#define ERAY1_EILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_EILS*)0xF0017028u)

/** \\brief  20, Error Service Request Register */
#define ERAY1_EIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIR*)0xF0017020u)

/** \\brief  3F4, Endian Register */
#define ERAY1_ENDN /*lint --e(923)*/ (*(volatile Ifx_ERAY_ENDN*)0xF00173F4u)

/** \\brief  130, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017130u)

/** Alias (User Manual Name) for ERAY1_ESID_1S0.
* To use register names with standard convension, please use ERAY1_ESID_1S0.
*/
#define	ERAY1_ESID01	(ERAY1_ESID_1S0)

/** \\brief  134, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017134u)

/** Alias (User Manual Name) for ERAY1_ESID_1S1.
* To use register names with standard convension, please use ERAY1_ESID_1S1.
*/
#define	ERAY1_ESID02	(ERAY1_ESID_1S1)

/** \\brief  158, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017158u)

