HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** \\brief  510, Input Buffer Command Mask */
#define ERAY1_IBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCM*)0xF0017510u)

/** \\brief  514, Input Buffer Command Request */
#define ERAY1_IBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCR*)0xF0017514u)

/** \\brief  8, Module Identification Register */
#define ERAY1_ID /*lint --e(923)*/ (*(volatile Ifx_ERAY_ID*)0xF0017008u)

/** \\brief  40, Service Request Line Enable */
#define ERAY1_ILE /*lint --e(923)*/ (*(volatile Ifx_ERAY_ILE*)0xF0017040u)

/** \\brief  8F4, Kernel Reset Register 0 */
#define ERAY1_KRST0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST0*)0xF00178F4u)

/** \\brief  8F0, Kernel Reset Register 1 */
#define ERAY1_KRST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST1*)0xF00178F0u)

/** \\brief  8EC, Kernel Reset Status Clear Register */
#define ERAY1_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRSTCLR*)0xF00178ECu)

/** \\brief  1C, Lock Register */
#define ERAY1_LCK /*lint --e(923)*/ (*(volatile Ifx_ERAY_LCK*)0xF001701Cu)

/** \\brief  314, Last Dynamic Transmit Slot */
#define ERAY1_LDTS /*lint --e(923)*/ (*(volatile Ifx_ERAY_LDTS*)0xF0017314u)

/** \\brief  70C, Message Buffer Status */
#define ERAY1_MBS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBS*)0xF001770Cu)

/** \\brief  340, Message Buffer Status Changed 1 */
#define ERAY1_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC1*)0xF0017340u)

/** \\brief  344, Message Buffer Status Changed 2 */
#define ERAY1_MBSC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC2*)0xF0017344u)

/** \\brief  348, Message Buffer Status Changed 3 */
#define ERAY1_MBSC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC3*)0xF0017348u)

/** \\brief  34C, Message Buffer Status Changed 4 */
#define ERAY1_MBSC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC4*)0xF001734Cu)

/** \\brief  98, MHD Configuration Register */
#define ERAY1_MHDC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDC*)0xF0017098u)

/** \\brief  31C, Message Handler Constraints Flags */
#define ERAY1_MHDF /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDF*)0xF001731Cu)

/** \\brief  310, Message Handler Status */
#define ERAY1_MHDS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDS*)0xF0017310u)

/** \\brief  300, Message RAM Configuration */
#define ERAY1_MRC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MRC*)0xF0017300u)

/** \\brief  3B8, Message Buffer Status Changed Interrupt Control 1 */
#define ERAY1_MSIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC1*)0xF00173B8u)

/** \\brief  3BC, Message Buffer Status Changed Interrupt Control 2 */
#define ERAY1_MSIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC2*)0xF00173BCu)

/** \\brief  3C0, Message Buffer Status Changed Interrupt Control 3 */
#define ERAY1_MSIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC3*)0xF00173C0u)

/** \\brief  3C4, Message Buffer Status Changed Interrupt Control 4 */
#define ERAY1_MSIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC4*)0xF00173C4u)

/** \\brief  114, Macrotick and Cycle Counter Value */
#define ERAY1_MTCCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_MTCCV*)0xF0017114u)

/** \\brief  330, New Data Register 1 */
#define ERAY1_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT1*)0xF0017330u)

/** \\brief  334, New Data Register 2 */
#define ERAY1_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT2*)0xF0017334u)

/** \\brief  338, New Data Register 3 */
#define ERAY1_NDAT3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT3*)0xF0017338u)

/** \\brief  33C, New Data Register 4 */
#define ERAY1_NDAT4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT4*)0xF001733Cu)

/** \\brief  3A8, New Data Interrupt Control 1 */
#define ERAY1_NDIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC1*)0xF00173A8u)

/** \\brief  3AC, New Data Interrupt Control 2 */
#define ERAY1_NDIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC2*)0xF00173ACu)

/** \\brief  3B0, New Data Interrupt Control 3 */
#define ERAY1_NDIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC3*)0xF00173B0u)

/** \\brief  3B4, New Data Interrupt Control 4 */
#define ERAY1_NDIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC4*)0xF00173B4u)

/** \\brief  8C, NEM Configuration Register */
#define ERAY1_NEMC /*lint --e(923)*/ (*(volatile Ifx_ERAY_NEMC*)0xF001708Cu)

/** \\brief  1B0, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY1_NMV_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B0u)

/** Alias (User Manual Name) for ERAY1_NMV_1S0.
* To use register names with standard convension, please use ERAY1_NMV_1S0.
*/
#define	ERAY1_NMV1	(ERAY1_NMV_1S0)

/** \\brief  1B4, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY1_NMV_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B4u)

/** Alias (User Manual Name) for ERAY1_NMV_1S1.
* To use register names with standard convension, please use ERAY1_NMV_1S1.
*/
#define	ERAY1_NMV2	(ERAY1_NMV_1S1)

/** \\brief  1B8, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY1_NMV_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B8u)

/** Alias (User Manual Name) for ERAY1_NMV_1S2.
* To use register names with standard convension, please use ERAY1_NMV_1S2.
*/
#define	ERAY1_NMV3	(ERAY1_NMV_1S2)

/** \\brief  710, Output Buffer Command Mask */
#define ERAY1_OBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCM*)0xF0017710u)

/** \\brief  714, Output Buffer Command Request */
#define ERAY1_OBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCR*)0xF0017714u)

/** \\brief  8E8, OCDS Control and Status */
#define ERAY1_OCS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCS*)0xF00178E8u)

/** \\brief  11C, Offset Correction Value */
#define ERAY1_OCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCV*)0xF001711Cu)

/** \\brief  170, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017170u)

