HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY1_OSID_1S0.
* To use register names with standard convension, please use ERAY1_OSID_1S0.
*/
#define	ERAY1_OSID01	(ERAY1_OSID_1S0)

/** \\brief  174, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017174u)

/** Alias (User Manual Name) for ERAY1_OSID_1S1.
* To use register names with standard convension, please use ERAY1_OSID_1S1.
*/
#define	ERAY1_OSID02	(ERAY1_OSID_1S1)

/** \\brief  198, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017198u)

/** Alias (User Manual Name) for ERAY1_OSID_1S10.
* To use register names with standard convension, please use ERAY1_OSID_1S10.
*/
#define	ERAY1_OSID11	(ERAY1_OSID_1S10)

/** \\brief  19C, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF001719Cu)

/** Alias (User Manual Name) for ERAY1_OSID_1S11.
* To use register names with standard convension, please use ERAY1_OSID_1S11.
*/
#define	ERAY1_OSID12	(ERAY1_OSID_1S11)

/** \\brief  1A0, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A0u)

/** Alias (User Manual Name) for ERAY1_OSID_1S12.
* To use register names with standard convension, please use ERAY1_OSID_1S12.
*/
#define	ERAY1_OSID13	(ERAY1_OSID_1S12)

/** \\brief  1A4, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A4u)

/** Alias (User Manual Name) for ERAY1_OSID_1S13.
* To use register names with standard convension, please use ERAY1_OSID_1S13.
*/
#define	ERAY1_OSID14	(ERAY1_OSID_1S13)

/** \\brief  1A8, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A8u)

/** Alias (User Manual Name) for ERAY1_OSID_1S14.
* To use register names with standard convension, please use ERAY1_OSID_1S14.
*/
#define	ERAY1_OSID15	(ERAY1_OSID_1S14)

/** \\brief  178, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017178u)

/** Alias (User Manual Name) for ERAY1_OSID_1S2.
* To use register names with standard convension, please use ERAY1_OSID_1S2.
*/
#define	ERAY1_OSID03	(ERAY1_OSID_1S2)

/** \\brief  17C, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF001717Cu)

/** Alias (User Manual Name) for ERAY1_OSID_1S3.
* To use register names with standard convension, please use ERAY1_OSID_1S3.
*/
#define	ERAY1_OSID04	(ERAY1_OSID_1S3)

/** \\brief  180, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017180u)

/** Alias (User Manual Name) for ERAY1_OSID_1S4.
* To use register names with standard convension, please use ERAY1_OSID_1S4.
*/
#define	ERAY1_OSID05	(ERAY1_OSID_1S4)

/** \\brief  184, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017184u)

/** Alias (User Manual Name) for ERAY1_OSID_1S5.
* To use register names with standard convension, please use ERAY1_OSID_1S5.
*/
#define	ERAY1_OSID06	(ERAY1_OSID_1S5)

/** \\brief  188, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017188u)

/** Alias (User Manual Name) for ERAY1_OSID_1S6.
* To use register names with standard convension, please use ERAY1_OSID_1S6.
*/
#define	ERAY1_OSID07	(ERAY1_OSID_1S6)

/** \\brief  18C, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF001718Cu)

/** Alias (User Manual Name) for ERAY1_OSID_1S7.
* To use register names with standard convension, please use ERAY1_OSID_1S7.
*/
#define	ERAY1_OSID08	(ERAY1_OSID_1S7)

/** \\brief  190, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017190u)

/** Alias (User Manual Name) for ERAY1_OSID_1S8.
* To use register names with standard convension, please use ERAY1_OSID_1S8.
*/
#define	ERAY1_OSID09	(ERAY1_OSID_1S8)

/** \\brief  194, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY1_OSID_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017194u)

/** Alias (User Manual Name) for ERAY1_OSID_1S9.
* To use register names with standard convension, please use ERAY1_OSID_1S9.
*/
#define	ERAY1_OSID10	(ERAY1_OSID_1S9)

/** \\brief  870, OCDS Trigger Set Select */
#define ERAY1_OTSS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OTSS*)0xF0017870u)

/** \\brief  90, PRT Configuration Register 1 */
#define ERAY1_PRTC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC1*)0xF0017090u)

/** \\brief  94, PRT Configuration Register 2 */
#define ERAY1_PRTC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC2*)0xF0017094u)

/** \\brief  118, Rate Correction Value */
#define ERAY1_RCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_RCV*)0xF0017118u)

/** \\brief  600, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017600u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S0.
* To use register names with standard convension, please use ERAY1_RDDS_1S0.
*/
#define	ERAY1_RDDS01	(ERAY1_RDDS_1S0)

