HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** \\brief  6A8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S42 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S42.
* To use register names with standard convension, please use ERAY1_RDDS_1S42.
*/
#define	ERAY1_RDDS43	(ERAY1_RDDS_1S42)

/** \\brief  6AC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S43 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176ACu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S43.
* To use register names with standard convension, please use ERAY1_RDDS_1S43.
*/
#define	ERAY1_RDDS44	(ERAY1_RDDS_1S43)

/** \\brief  6B0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S44 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176B0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S44.
* To use register names with standard convension, please use ERAY1_RDDS_1S44.
*/
#define	ERAY1_RDDS45	(ERAY1_RDDS_1S44)

/** \\brief  6B4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S45 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176B4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S45.
* To use register names with standard convension, please use ERAY1_RDDS_1S45.
*/
#define	ERAY1_RDDS46	(ERAY1_RDDS_1S45)

/** \\brief  6B8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S46 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176B8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S46.
* To use register names with standard convension, please use ERAY1_RDDS_1S46.
*/
#define	ERAY1_RDDS47	(ERAY1_RDDS_1S46)

/** \\brief  6BC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S47 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176BCu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S47.
* To use register names with standard convension, please use ERAY1_RDDS_1S47.
*/
#define	ERAY1_RDDS48	(ERAY1_RDDS_1S47)

/** \\brief  6C0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S48 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176C0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S48.
* To use register names with standard convension, please use ERAY1_RDDS_1S48.
*/
#define	ERAY1_RDDS49	(ERAY1_RDDS_1S48)

/** \\brief  6C4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S49 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176C4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S49.
* To use register names with standard convension, please use ERAY1_RDDS_1S49.
*/
#define	ERAY1_RDDS50	(ERAY1_RDDS_1S49)

/** \\brief  614, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017614u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S5.
* To use register names with standard convension, please use ERAY1_RDDS_1S5.
*/
#define	ERAY1_RDDS06	(ERAY1_RDDS_1S5)

/** \\brief  6C8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S50 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176C8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S50.
* To use register names with standard convension, please use ERAY1_RDDS_1S50.
*/
#define	ERAY1_RDDS51	(ERAY1_RDDS_1S50)

/** \\brief  6CC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S51 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176CCu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S51.
* To use register names with standard convension, please use ERAY1_RDDS_1S51.
*/
#define	ERAY1_RDDS52	(ERAY1_RDDS_1S51)

/** \\brief  6D0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S52 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176D0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S52.
* To use register names with standard convension, please use ERAY1_RDDS_1S52.
*/
#define	ERAY1_RDDS53	(ERAY1_RDDS_1S52)

/** \\brief  6D4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S53 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176D4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S53.
* To use register names with standard convension, please use ERAY1_RDDS_1S53.
*/
#define	ERAY1_RDDS54	(ERAY1_RDDS_1S53)

/** \\brief  6D8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S54 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176D8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S54.
* To use register names with standard convension, please use ERAY1_RDDS_1S54.
*/
#define	ERAY1_RDDS55	(ERAY1_RDDS_1S54)

/** \\brief  6DC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S55 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176DCu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S55.
* To use register names with standard convension, please use ERAY1_RDDS_1S55.
*/
#define	ERAY1_RDDS56	(ERAY1_RDDS_1S55)

/** \\brief  6E0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S56 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176E0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S56.
* To use register names with standard convension, please use ERAY1_RDDS_1S56.
*/
#define	ERAY1_RDDS57	(ERAY1_RDDS_1S56)

