HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** \\brief  48C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S35 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001748Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S35.
* To use register names with standard convension, please use ERAY1_WRDS_1S35.
*/
#define	ERAY1_WRDS36	(ERAY1_WRDS_1S35)

/** \\brief  490, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S36 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017490u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S36.
* To use register names with standard convension, please use ERAY1_WRDS_1S36.
*/
#define	ERAY1_WRDS37	(ERAY1_WRDS_1S36)

/** \\brief  494, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S37 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017494u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S37.
* To use register names with standard convension, please use ERAY1_WRDS_1S37.
*/
#define	ERAY1_WRDS38	(ERAY1_WRDS_1S37)

/** \\brief  498, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S38 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017498u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S38.
* To use register names with standard convension, please use ERAY1_WRDS_1S38.
*/
#define	ERAY1_WRDS39	(ERAY1_WRDS_1S38)

/** \\brief  49C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S39 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001749Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S39.
* To use register names with standard convension, please use ERAY1_WRDS_1S39.
*/
#define	ERAY1_WRDS40	(ERAY1_WRDS_1S39)

/** \\brief  410, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017410u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S4.
* To use register names with standard convension, please use ERAY1_WRDS_1S4.
*/
#define	ERAY1_WRDS05	(ERAY1_WRDS_1S4)

/** \\brief  4A0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S40 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A0u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S40.
* To use register names with standard convension, please use ERAY1_WRDS_1S40.
*/
#define	ERAY1_WRDS41	(ERAY1_WRDS_1S40)

/** \\brief  4A4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S41 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S41.
* To use register names with standard convension, please use ERAY1_WRDS_1S41.
*/
#define	ERAY1_WRDS42	(ERAY1_WRDS_1S41)

/** \\brief  4A8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S42 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A8u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S42.
* To use register names with standard convension, please use ERAY1_WRDS_1S42.
*/
#define	ERAY1_WRDS43	(ERAY1_WRDS_1S42)

/** \\brief  4AC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S43 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174ACu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S43.
* To use register names with standard convension, please use ERAY1_WRDS_1S43.
*/
#define	ERAY1_WRDS44	(ERAY1_WRDS_1S43)

/** \\brief  4B0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S44 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B0u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S44.
* To use register names with standard convension, please use ERAY1_WRDS_1S44.
*/
#define	ERAY1_WRDS45	(ERAY1_WRDS_1S44)

/** \\brief  4B4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S45 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S45.
* To use register names with standard convension, please use ERAY1_WRDS_1S45.
*/
#define	ERAY1_WRDS46	(ERAY1_WRDS_1S45)

/** \\brief  4B8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S46 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B8u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S46.
* To use register names with standard convension, please use ERAY1_WRDS_1S46.
*/
#define	ERAY1_WRDS47	(ERAY1_WRDS_1S46)

/** \\brief  4BC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S47 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174BCu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S47.
* To use register names with standard convension, please use ERAY1_WRDS_1S47.
*/
#define	ERAY1_WRDS48	(ERAY1_WRDS_1S47)

/** \\brief  4C0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S48 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174C0u)

