HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY1_WRDS_1S48.
* To use register names with standard convension, please use ERAY1_WRDS_1S48.
*/
#define	ERAY1_WRDS49	(ERAY1_WRDS_1S48)

/** \\brief  4C4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S49 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174C4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S49.
* To use register names with standard convension, please use ERAY1_WRDS_1S49.
*/
#define	ERAY1_WRDS50	(ERAY1_WRDS_1S49)

/** \\brief  414, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017414u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S5.
* To use register names with standard convension, please use ERAY1_WRDS_1S5.
*/
#define	ERAY1_WRDS06	(ERAY1_WRDS_1S5)

/** \\brief  4C8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S50 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174C8u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S50.
* To use register names with standard convension, please use ERAY1_WRDS_1S50.
*/
#define	ERAY1_WRDS51	(ERAY1_WRDS_1S50)

/** \\brief  4CC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S51 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174CCu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S51.
* To use register names with standard convension, please use ERAY1_WRDS_1S51.
*/
#define	ERAY1_WRDS52	(ERAY1_WRDS_1S51)

/** \\brief  4D0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S52 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174D0u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S52.
* To use register names with standard convension, please use ERAY1_WRDS_1S52.
*/
#define	ERAY1_WRDS53	(ERAY1_WRDS_1S52)

/** \\brief  4D4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S53 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174D4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S53.
* To use register names with standard convension, please use ERAY1_WRDS_1S53.
*/
#define	ERAY1_WRDS54	(ERAY1_WRDS_1S53)

/** \\brief  4D8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S54 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174D8u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S54.
* To use register names with standard convension, please use ERAY1_WRDS_1S54.
*/
#define	ERAY1_WRDS55	(ERAY1_WRDS_1S54)

/** \\brief  4DC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S55 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174DCu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S55.
* To use register names with standard convension, please use ERAY1_WRDS_1S55.
*/
#define	ERAY1_WRDS56	(ERAY1_WRDS_1S55)

/** \\brief  4E0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S56 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174E0u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S56.
* To use register names with standard convension, please use ERAY1_WRDS_1S56.
*/
#define	ERAY1_WRDS57	(ERAY1_WRDS_1S56)

/** \\brief  4E4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S57 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174E4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S57.
* To use register names with standard convension, please use ERAY1_WRDS_1S57.
*/
#define	ERAY1_WRDS58	(ERAY1_WRDS_1S57)

/** \\brief  4E8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S58 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174E8u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S58.
* To use register names with standard convension, please use ERAY1_WRDS_1S58.
*/
#define	ERAY1_WRDS59	(ERAY1_WRDS_1S58)

/** \\brief  4EC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S59 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174ECu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S59.
* To use register names with standard convension, please use ERAY1_WRDS_1S59.
*/
#define	ERAY1_WRDS60	(ERAY1_WRDS_1S59)

/** \\brief  418, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017418u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S6.
* To use register names with standard convension, please use ERAY1_WRDS_1S6.
*/
#define	ERAY1_WRDS07	(ERAY1_WRDS_1S6)

/** \\brief  4F0, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S60 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174F0u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S60.
* To use register names with standard convension, please use ERAY1_WRDS_1S60.
*/
#define	ERAY1_WRDS61	(ERAY1_WRDS_1S60)

/** \\brief  4F4, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S61 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174F4u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S61.
* To use register names with standard convension, please use ERAY1_WRDS_1S61.
*/
#define	ERAY1_WRDS62	(ERAY1_WRDS_1S61)

/** \\brief  4F8, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174F8u)

