HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY1_WRDS_1S62.
* To use register names with standard convension, please use ERAY1_WRDS_1S62.
*/
#define	ERAY1_WRDS63	(ERAY1_WRDS_1S62)

/** \\brief  4FC, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174FCu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S63.
* To use register names with standard convension, please use ERAY1_WRDS_1S63.
*/
#define	ERAY1_WRDS64	(ERAY1_WRDS_1S63)

/** \\brief  41C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001741Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S7.
* To use register names with standard convension, please use ERAY1_WRDS_1S7.
*/
#define	ERAY1_WRDS08	(ERAY1_WRDS_1S7)

/** \\brief  420, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017420u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S8.
* To use register names with standard convension, please use ERAY1_WRDS_1S8.
*/
#define	ERAY1_WRDS09	(ERAY1_WRDS_1S8)

/** \\brief  424, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017424u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S9.
* To use register names with standard convension, please use ERAY1_WRDS_1S9.
*/
#define	ERAY1_WRDS10	(ERAY1_WRDS_1S9)

/** \\brief  500, Write Header Section 1 */
#define ERAY1_WRHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS1*)0xF0017500u)

/** \\brief  504, Write Header Section 2 */
#define ERAY1_WRHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS2*)0xF0017504u)

/** \\brief  508, Write Header Section 3 */
#define ERAY1_WRHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS3*)0xF0017508u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXERAY_REG_H */
